### Output
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```Terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_application_insights.appinsights has been deleted
  - resource "azurerm_application_insights" "appinsights" {
      - connection_string                     = (sensitive value) -> null
        id                                    = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.Insights/components/appi-pd-todo-dev"
      - instrumentation_key                   = (sensitive value) -> null
        name                                  = "appi-pd-todo-dev"
        tags                                  = {
            "azd-env-name" = "dev"
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_key_vault.vault has been deleted
  - resource "azurerm_key_vault" "vault" {
        id                              = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.KeyVault/vaults/kvk-pd-todo-dev"
        name                            = "kvk-pd-todo-dev"
        tags                            = {
            "azd-env-name" = "dev"
        }
      - vault_uri                       = "https://kvk-pd-todo-dev.vault.azure.net/" -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_log_analytics_workspace.loganalytics has been deleted
  - resource "azurerm_log_analytics_workspace" "loganalytics" {
      - id                              = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.OperationalInsights/workspaces/log-pd-todo-dev" -> null
        name                            = "log-pd-todo-dev"
        tags                            = {
            "azd-env-name" = "dev"
        }
        # (13 unchanged attributes hidden)
    }

  # azurerm_mssql_server.sqlserver has been deleted
  - resource "azurerm_mssql_server" "sqlserver" {
      - id                                   = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.Sql/servers/sql-pd-todo-dev" -> null
        name                                 = "sql-pd-todo-dev"
        tags                                 = {
            "azd-env-name" = "dev"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev"
      - location = "uksouth" -> null
      - name     = "rg-pd-todo-dev" -> null
        tags     = {
            "azd-env-name" = "dev"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurecaf_name.apiapp_managedId_name will be created
  + resource "azurecaf_name" "apiapp_managedId_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "general"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.apiapp_name will be created
  + resource "azurecaf_name" "apiapp_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_app_service"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "api",
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.apiapp_serviceplan_name will be created
  + resource "azurecaf_name" "apiapp_serviceplan_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_app_service_plan"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.apiapp_storageacc_name will be created
  + resource "azurecaf_name" "apiapp_storageacc_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.appserviceplan_name will be destroyed
  # (because azurecaf_name.appserviceplan_name is not in configuration)
  - resource "azurecaf_name" "appserviceplan_name" {
      - clean_input   = true -> null
      - id            = "aqwupninbxhsbbvm" -> null
      - name          = "pd-todo" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_app_service" -> null
      - result        = "app-pd-todo-dev" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "dev",
        ] -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.functionapp_name will be destroyed
  # (because azurecaf_name.functionapp_name is not in configuration)
  - resource "azurecaf_name" "functionapp_name" {
      - clean_input   = true -> null
      - id            = "lhyprdhwuxscalqb" -> null
      - name          = "pd-todo" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_app_service" -> null
      - result        = "app-pd-todo-api-dev" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "api",
          - "dev",
        ] -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.managedId_name will be destroyed
  # (because azurecaf_name.managedId_name is not in configuration)
  - resource "azurecaf_name" "managedId_name" {
      - clean_input   = true -> null
      - id            = "ncajxywfqtkysigm" -> null
      - name          = "pd-todo" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "general" -> null
      - result        = "pd-todo-dev" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "dev",
        ] -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.storageacc_name will be destroyed
  # (because azurecaf_name.storageacc_name is not in configuration)
  - resource "azurecaf_name" "storageacc_name" {
      - clean_input   = true -> null
      - id            = "gheyvyekxnmmefof" -> null
      - name          = "pd-todo" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_storage_account" -> null
      - result        = "stpdtododev" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "dev",
        ] -> null
      - use_slug      = true -> null
    }

  # azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "appi-pd-todo-dev"
      + resource_group_name                   = "rg-pd-todo-dev"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "azd-env-name" = "dev"
        }
      + workspace_id                          = (known after apply)
    }

  # azurerm_key_vault.vault will be created
  + resource "azurerm_key_vault" "vault" {
      + access_policy                 = [
          + {
              + key_permissions = [
                  + "Get",
                  + "List",
                ]
              + object_id       = "550e8400-e29b-41d4-a716-446655440000"
              + tenant_id       = "dbba3d9f-8b34-49b7-878a-d3d0d70056ce"
            },
        ]
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "kvk-pd-todo-dev"
      + public_network_access_enabled = true
      + resource_group_name           = "rg-pd-todo-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "azd-env-name" = "dev"
        }
      + tenant_id                     = "dbba3d9f-8b34-49b7-878a-d3d0d70056ce"
      + vault_uri                     = (known after apply)
    }

  # azurerm_log_analytics_workspace.loganalytics will be created
  + resource "azurerm_log_analytics_workspace" "loganalytics" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "uksouth"
      + name                               = "log-pd-todo-dev"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "rg-pd-todo-dev"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "azd-env-name" = "dev"
        }
      + workspace_id                       = (known after apply)
    }

  # azurerm_mssql_database.db will be created
  + resource "azurerm_mssql_database" "db" {
      + auto_pause_delay_in_minutes         = (known after apply)
      + collation                           = (known after apply)
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = (known after apply)
      + min_capacity                        = (known after apply)
      + name                                = "todo"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = "GP_S_Gen5_2"
      + storage_account_type                = "Geo"
      + tags                                = {
          + "azd-env-name" = "dev"
        }
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = (known after apply)
    }

  # azurerm_mssql_server.sqlserver will be created
  + resource "azurerm_mssql_server" "sqlserver" {
      + administrator_login                  = "mradministrator"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "uksouth"
      + minimum_tls_version                  = "1.2"
      + name                                 = "sql-pd-todo-dev"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "rg-pd-todo-dev"
      + restorable_dropped_database_ids      = (known after apply)
      + tags                                 = {
          + "azd-env-name" = "dev"
        }
      + version                              = "12.0"
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-pd-todo-dev"
      + tags     = {
          + "azd-env-name" = "dev"
        }
    }

  # module.api.azurerm_linux_function_app.apiapp will be created
  + resource "azurerm_linux_function_app" "apiapp" {
      + app_settings                      = (known after apply)
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = (known after apply)
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "rg-pd-todo-dev"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = (known after apply)
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "azd-env-name"     = "dev"
          + "azd-service-name" = "api"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + application_insights_key                = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = false
            }
        }
    }

  # module.api.azurerm_service_plan.apiapp_serviceplan will be created
  + resource "azurerm_service_plan" "apiapp_serviceplan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = (known after apply)
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-pd-todo-dev"
      + sku_name                     = "Y1"
      + tags                         = {
          + "azd-env-name"     = "dev"
          + "azd-service-name" = "api"
        }
      + worker_count                 = (known after apply)
    }

  # module.api.azurerm_storage_account.apiapp_storage will be created
  + resource "azurerm_storage_account" "apiapp_storage" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg-pd-todo-dev"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "azd-env-name"     = "dev"
          + "azd-service-name" = "api"
        }
    }

  # module.api.azurerm_user_assigned_identity.applicationIdentity will be created
  + resource "azurerm_user_assigned_identity" "applicationIdentity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "rg-pd-todo-dev"
      + tags                = {
          + "azd-env-name"     = "dev"
          + "azd-service-name" = "api"
        }
      + tenant_id           = (known after apply)
    }

  # module.web.azurerm_static_site.web will be created
  + resource "azurerm_static_site" "web" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "app-pd-todo-static-dev"
      + resource_group_name = "rg-pd-todo-dev"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "azd-env-name"     = "dev"
          + "azd-service-name" = "web"
        }
    }

Plan: 15 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ APPLICATIONINSIGHTS_CONNECTION_STRING           = "InstrumentationKey=c7867a50-487a-4f0d-9f82-24161cf37056;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/" -> (known after apply)
  ~ AZURE_KEY_VAULT_ENDPOINT                        = "https://kvk-pd-todo-dev.vault.azure.net/" -> (known after apply)
  ~ REACT_APP_API_BASE_URL                          = "https://app-pd-todo-api-dev.azurewebsites.net" -> (known after apply)
  ~ REACT_APP_APPLICATIONINSIGHTS_CONNECTION_STRING = "InstrumentationKey=c7867a50-487a-4f0d-9f82-24161cf37056;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/" -> (known after apply)
  ~ REACT_APP_WEB_BASE_URL                          = "https://yellow-moss-0e9bebd03.3.azurestaticapps.net" -> (known after apply)

```

</details>

*Pusher: @nigelhamer, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform plan`*